<template>
  <ElTabs v-model="activeName" class="demo-tabs">
    <ElTabPane label="简介" name="first">
      <h3>首部及导言</h3>
      <h4>欢迎您使用Openpo.com本产品及服务！</h4>
      <p>
        为使用Openpo.com产品及服务（以下简称“本产品”或”Openpo”），您应当阅读并遵守《Openpo.com产品许可及服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免责条款可能以加粗形式提示您注意。
        除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用本产品及相关服务。您的下载、安装、使用、获取Openpo帐号、登录等行为即视为您已阅读并同意上述协议的约束。如果您未满18周岁，请在法定监护人的陪同下阅读本协议及上述其他协议，并特别注意未成年人使用条款。
      </p>
    </ElTabPane>
    <ElTabPane label="服务条款" name="second">
      <ElTabs tab-position="left">
        <div class="info-show">
          <ElTabPane label="一、协议的范围">
            <h4>1.1 协议适用主体范围</h4>
            <p>本协议是您与麦屿(上海)数据科技有限公司(以下简称”麦屿”)之间关于您下载、安装、使用、复制本产品，以及使用麦屿相关服务所订立的协议。</p>
            <h4>1.2 协议关系及冲突条款</h4>
            <p>
              本协议内容同时包括麦屿可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。
            </p>
          </ElTabPane>
          <ElTabPane label="二、关于本服务">
            <h4>2.1本服务的内容</h4>
            <p>
              本服务内容是指麦屿向用户提供的跨平台的在线协同表格服务, 包括但不限于展示,推荐,制作企业基本信息, 产品册, 工艺, 技术等对外资料,及帮助企业联系到产业链上下游相关决策人员。解决的核心需求是帮助用户快速便捷的管理和协同供应链数据。
            </p>
            <span>
              2.1.1
              Openpo.com本身不储存用户数据, 所有数据将会被存储在第三方云储存平台如阿里云或亚马逊云. 未经用户同意,
              Openpo.com无权获取用户上传的任何表格内容.
            </span>

            <h4>2.2本服务的数据处理</h4>
            <span>
              2.2.1 用户必须理解并同意麦屿收集，处理，加工，存储，发布以上条款中所提数据之后再完成本产品的注册、使用或购买。若不同意，请放弃注册、使用或购买Openpo产品。若用户已经上传数据到本产品，希望Openpo删除 所有数据，必须向麦屿提出书面申请。 关于详细用户信息保护条款，请参考本协议第五章。
            </span>

            <h4>2.3 本服务的形式</h4>
            <span>
              2.3.1
              您使用本服务需要下载或登录Openpo.com客户端或网页，麦屿给予您一项个人或公司的、不可转让及非排他性的许可。
            </span>
            <span>
              2.3.2
              本服务中Openpo.com客户端及网站可能提供包括但不限于iOS、Android、电脑网页及Openpo小程序.
            </span>
            <h4>2.4 本服务许可的范围</h4>
            <span>
              2.4.1
              本产品及服务的所有数据和无形资产都为麦屿所有, 不得未经麦屿允许复制任何本产品的数据。
            </span>
            <span>
              2.4.2
              本条及本协议其他条款未明示授权的其他一切权利仍由麦屿保留，您在行使这些权利时须另外取得麦屿的书面许可。麦屿如果未行使前述任何权利，并不构成对该权利的放弃。
            </span>
          </ElTabPane>
          <ElTabPane label="三、本产品的安装与卸载">
            <p>3.1 麦屿可能为不同的终端设备开发了不同的本产品版本及网页，您应当根据实际情况选择下载合适的版本进行安装或使用。</p>
            <p>3.2 下载安装程序后，您需要按照该程序提示的步骤正确安装。</p>
            <p>3.3 为提供更加优质、安全的服务，在本产品安装时麦屿可能推荐您安装其他本产品和服务，您可以选择安装或不安装。</p>
            <p>3.4 如果您不再需要使用本产品或者需要安装新版本产品，可以自行卸载。如果您愿意帮助麦屿改进产品服务，请告知卸载的原因。</p>
          </ElTabPane>
          <ElTabPane label="四、本产品的更新">
            <p>
              4.1 为了改善用户体验、完善服务内容，麦屿将不断努力开发新的服务，并为您不时提供本产品更新（这些更新可能会采取本产品替换、修改、功能强化、版本升级等形式）。
            </p>
            <p>
              4.2 为了保证本产品及服务的安全性和功能的一致性，麦屿有权不经向您特别通知而对本产品进行更新，或者对本产品的部分功能效果进行改变或限制。
            </p>
            <p>
              4.3 本产品新版本发布后，旧版本的本产品可能无法使用。麦屿不保证旧版本产品继续可用及相应的客户服务，请您随时核对并下载最新版本。
            </p>
          </ElTabPane>
          <ElTabPane label="五、企业及用户信息保护">
            <p>
              5.1 保护用户企业及个人信息是麦屿的一项基本原则，麦屿将会采取合理的措施保护用户的企业及个人信息。除法律法规规定的情形外，未经用户许可麦屿不会向第三方（非合作）公开、透露用户企业及个人信息。麦屿对相关信息采用专业加密存储与传输方式，保障用户企业及个人信息的安全。
            </p>
            <p>
              5.2 您在注册帐号或使用本服务的过程中，需要提供一些必要的信息，例如：为向您提供帐号注册服务或进行用户身份识别，需要您填写手机号码; 搜索附近的产业链同行功能需要您同意使用您所在的地理位置信息；产业链匹配功能需要您授权访问手机通讯录等；企业的产品册；部分企业人员的职务，名称，电话及邮件（公司优先）。若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您提供的信息不完整，则无法使用本服务或在使用过程中受到限制。
            </p>
            <p>
              5.3 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
            </p>
            <p>
              5.4 麦屿将运用各种安全技术和程序建立完善的管理制度来保护您的个人及企业信息，以免遭受未经授权的访问、使用或披露。
            </p>
            <p>
              5.5 未经您的同意，麦屿不会向麦屿以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。
            </p>
            <p>
              5.6 麦屿非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用麦屿的服务前，应事先取得您家长或法定监护人的书面同意。
            </p>
            <p>
              5.7 对于您公开的企业及个人信息，您同意我们可以根据该信息进行大数据技术的关联和匹配等应用拓展。例如，为您提供用户信息服务，为您使用我们的产品和服务时能够避免多次重复输入相同信息，为您提供符合您个性的内容等。对您的信息进行关联和匹配等应用拓展所反馈的结果可能不准确，请您在使用相关服务时谨慎独立判断，我们难以保证算法自动匹配的结果必然为准确，您同意我们对于相关结果的准确性不承担任何责任。
            </p>
          </ElTabPane>
          <ElTabPane label="六、主权利义务条款">
            <h4> 6.1 帐号使用规范</h4>
            <span>
              6.1.1 您在使用本服务前需要注册一个Openpo帐号。Openpo帐号可通过手机号码进行注册,并可在注册成功后绑定公司信息、企业邮箱帐号等。如您使用邮箱帐号进行绑定，请您使用未与Openpo公众平台帐号绑定的邮箱帐号。麦屿有权根据用户需求或产品需要对帐号注册和绑定的方式进行变更.
            </span>
            <span>
              6.1.2 Openpo帐号的所有权归麦屿(上海)数据科技有限公司所有，用户完成申请注册手续后，仅获得Openpo帐号的使用权，且该使用权仅属于初始申请注册人或核实后实际企业名称所有者。同时，初始申请注册人不得赠与、借用、租用、转让或售卖Openpo帐号或者以其他方式许可非初始申请注册人使用Openpo帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用Openpo帐号。
            </span>
            <span>
              6.1.3 用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。当在您怀疑他人在使用您的帐号时，您应立即通知麦屿(上海)数据科技有限公司。
            </span>
            <span>
              6.1.4 用户在使用手机号码注册Openpo帐号时，系统将为您自动匹配Openpo号，您可以对Openpo号进行设置，但仅可设置一次，设置Openpo号后将无法修改。
            </span>
            <span>
              6.1.5  您在使用本产品客户端某一特定服务或功能时，该服务或功能可能会要求您基于Openpo帐号创建或注册新的帐号（以下简称“功能帐号”），您需依据具体要求进行操作。如无麦屿书面说明或者许可，前述帐号的所有权亦归麦屿(上海)数据科技有限公司所有，用户完成创建或注册操作后，仅获得该帐号的使用权，且该使用权同样仅属于初始申请注册人，初始申请注册人不得赠与、借用、租用、转让或售卖该帐号或者以其他方式许可非初始申请注册人使用该帐号，非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用该帐号。
            </span>
            <span>
              6.1.6  用户注册或创建Openpo帐号或功能帐号后如果长期不登录该帐号，麦屿有权回收该帐号，以免造成资源浪费，由此带来的任何损失均由用户自行承担。
            </span>
            <span>
              6.1.7 本产品有权限制您使用本服务与会员建立联系和进行互动的方式。
            </span>
            <h4>6.2 用户注意事项</h4>
            <span>
              6.2.1 您理解并同意：为了向您提供有效的服务，本产品会利用您终端设备的处理器和带宽等资源。本产品使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。
            </span>
            <span>
              6.2.2 您理解并同意： 由于本产品提供的软件和广告为特殊服务，在付费后麦屿就马上开始提供调研、建档和推广服务，故在交易确立完成后，不适用无理由退款退货，如无重大质量问题不予退换货。
            </span>
            <span>
              6.2.3 您理解并同意： 用户上传的数据许可麦屿在全球范围内享有免许可费、非独家的、可再许可及永久有效的使用权利。我们可以自行决定使用（包括但不限于复制、改编、修改、创建衍生作品、翻译）、传播这些内容。同时您许可麦屿有权就任何第三方对上述内容或其衍生品的侵权以自己名义提起诉讼，并获得全部赔偿。您保证已拥有必要授权对麦屿进行此许可。
            </span>
            <span>
              6.2.4 您理解并同意： 为了向您提供有效的服务，本产品能访问，保存，处理，使用和分享您提供的任何企业及个人数据，前提是遵守本协议第五条《企业及用户信息保护》的条款。
            </span>
            <span>
              6.2.5 您理解并同意： 仅提供不触犯法律和不侵犯他人权利（包括知识产权）的内容或信息。同时您提供的信息仅是您拥有所有权(或已经)并且真实和符合行政司法机关的信息。
            </span>
            <span> 6.2.6 您理解并同意： 您可能会看到不准确、不完整、过时、有误导性、非法、冒犯性或有害的内容或信息。本产品一般不审查“会员”或他人提供的内容。您同意我们不对他人 (包括其他“会员”) 的内容或信息负责。我们无法保证防止对本服务的这种滥用，而您同意我们不对这种滥用负责。
            </span>
            <span> 6.2.7 您理解并同意：本产品的某些功能可能会让第三方知晓用户的部分信息，例如：Openpo用户可以查询用户头像、名字、企业信息及产品册等可公开的个人及企业资料；使用手机号码注册Openpo帐号或手机号码与Openpo帐号关联的用户，Openpo帐号可以被通讯录存有该号码的好友查询；用户在Openpo查看搜索和收藏的产品册记录等。本产品和服务的第三方可以获取用户在Openpo主动公开或传输的相关信息，用户在选择前应充分了解其他第三方的产品功能及信息保护策略。Openpo中加密外呼及邮件功能目前由第三方提供。
            </span>
            <span> 6.2.8 您理解并同意： 用户上传产品册等信息即授予Openpo针对该产品的使用权。麦屿允许用户之间相互查看， 转发， 复制产品册信息。 如涉及商业机密产品内容或不便对公众公开的内容请不要上传至Openpo，可能因产品册公开浏览而造成的伤害或损失，麦屿不负责。
            </span>
            <span> 6.2.9 您理解并同意麦屿将会尽其商业上的合理努力保障您在本产品及服务中的数据存储安全，但是，麦屿并不能就此提供完全保证，包括但不限于以下情形：
            </span>
            <span> 6.2.9.1 麦屿不对您在本产品及服务中相关数据的删除或储存失败负责；
            </span>
            <span>6.2.9.2 麦屿有权根据实际情况自行决定单个用户在本产品及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份本产品及服务中的相关数据；
            </span>
            <span>6.2.9.3 如果您停止使用本产品及服务或服务被终止或取消，麦屿可以从服务器上永久地删除您的数据。服务停止、终止或取消后，麦屿没有义务向您返还任何数据。即使您删除共享信息，有关信息仍可能在您删除前由其他用户或不受我们控制的非关联第三方独立地复制或储存。请您更加谨慎地考虑上传、发布和交流的信息内容。
            </span>
            <span>6.2.10 用户在使用本产品及服务时，须自行承担如下来自麦屿不可掌控的风险内容，包括但不限于：
            </span>
            <span> 6.2.10.1 由于不可抗拒因素可能引起的个人及企业信息丢失、泄漏等风险；
            </span>
            <span>6.2.10.2 用户必须只将Openpo用于符合自己实际登记的公司的经营范围内的业务的信息展示,搜索及产业链上下游联系. 如因为上传,展示, 搜索, 联系非自己经营范围内的信息, 或出借账号, 或使用本产品的数据进行未许可商业行为，如盗用，提供给Openpo业务类似竞品，麦屿有权在不退款的情况下封锁用户账号, 对麦屿和其他用户所导致的任何问题或损害，均由该用户自行承担；
            </span>
            <span> 6.2.10.3 用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；
            </span>
            <span>6.2.10.4 由于无线网络信号不稳定、无线网络带宽小等原因，所引起的Openpo.com登录失败、资料同步不完整、页面打开速度慢等风险。
            </span>
            <h4>6.3 第三方产品和服务</h4>
            <span> 6.3.1 您在使用本产品第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。麦屿和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。
            </span>
            <span> 6.3.2 因用户使用本产品或要求麦屿提供特定服务时，本产品可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供，麦屿不保证通过第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与麦屿无关，麦屿不承担任何责任。
            </span>
            <span> 6.3.3 第三方服务提供者可以通过本产品向您提供产品或者服务，如邮件联系或者电话外呼功能。在此过程中，第三方服务提供者可能会收集、使用和存储您的相关数据或信息，麦屿通过与第三方服务提供者签署的有关协议、Openpo相关规范以及合理的产品流程设计，严格要求第三方服务提供者获取您的任何数据均应遵守相关法律法规的规定，采取必要的数据保护措施，且仅为产品或服务之目的合理使用您的相关数据，并在停止服务时必须删除全部数据等，尽最大可能保障您的数据和隐私不受侵害。您在接受或使用第三方产品或服务前应充分了解第三方产品或服务的条款及政策。如果您发现有第三方服务提供者存有相关违法违规行为，可以向麦屿投诉，麦屿将查实后予以处理。同时，基于服务质量考虑，第三方和麦屿可能对用户之间的通话进行录音， 若用户不希望被录音，请像麦屿提交书面申请。
            </span>
            <span> 6.3.4 您理解并同意，麦屿有权决定将本产品作商业用途，包括但不限于开发、使用本产品的部分服务为第三方作推广等，麦屿承诺在推广过程中严格按照本协议约定保护您的个人及公司信息，同时您亦可以根据系统设置选择屏蔽、拒绝接收相关推广信息。
            </span>
          </ElTabPane>
          <ElTabPane label="七、用户行为规范">
            <h4>7.1 信息内容规范</h4>
            <span> 7.1.1 本条所述信息内容是指用户使用本产品及服务过程中所制作、复制、发布、传播的任何内容，包括但不限于Openpo帐号或功能帐号的头像、名字、用户说明、简介等注册信息，或发送的文字、语音、图片、视频、表情等信息、朋友圈图文、视频动态、视频号内容和相关链接页面，以及其他使用Openpo帐号或功能帐号或本产品及服务所产生的内容。
            </span>
            <span>7.1.2 您理解并同意，Openpo一直致力于为用户提供文明健康、规范有序的网络环境，您不得利用Openpo帐号或功能帐号或本产品及服务制作、复制、发布、传播如下干扰Openpo正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于：
            </span>
            <span>7.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容：
            </span>
            <span style="font-size: 13px;">
              （1）违反宪法确定的基本原则的；<br>
              （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br>
              （3）损害国家荣誉和利益的；<br>
              （4）煽动民族仇恨、民族歧视，破坏民族团结的；<br>
              （5）破坏国家宗教政策，宣扬邪教和封建迷信的；<br>
              （6）散布谣言，扰乱社会秩序，破坏社会稳定的；<br>
              （7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；<br>
              （8）侮辱或者诽谤他人，侵害他人合法权益的；<br>
              （9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；<br>
              （10）以非法民间组织名义活动的；<br>
              （11）不符合《即时通信工具公众信息服务发展管理暂行规定》及遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；<br>
              （12）含有法律、行政法规禁止的其他内容的。
            </span>
            <span>  7.1.2.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；
            </span>
            <span>7.1.2.3 涉及他人隐私、个人信息或资料的；
            </span>
            <span> 7.1.2.4 发表、传送、传播骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的；
            </span>
            <span> 7.1.2.5 其他违反法律法规、政策及公序良俗、社会公德或干扰Openpo正常运营和侵犯其他用户或第三方合法权益内容的信息。
            </span>
            <h4>
              7.2 本产品使用规范
            </h4>
            <span>7.2.1 除非法律允许或麦屿书面许可，您使用本产品过程中不得从事下列行为：
            </span>
            <span style="font-size: 13px;">
              7.2.1.1 删除本产品及其副本上关于著作权的信息；<br>
              7.2.1.2 对本产品进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本产品的源代码；<br>
              7.2.1.3 对麦屿拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；<br>
              7.2.1.4 对本产品或者本产品运行过程中释放到任何终端内存中的数据、本产品运行过程中客户端与服务器端的交互数据，以及本产品运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非麦屿经授权的第三方工具/服务接入本产品和相关系统；<br>
              7.2.1.5 通过修改或伪造本产品运行中的指令、数据，增加、删减、变动本产品的功能或运行效果，或者将用于上述用途的本产品、方法进行运营或向公众传播，无论这些行为是否为商业目的；<br>
              7.2.1.6 通过非麦屿开发、授权的第三方本产品、插件、外挂、系统，登录或使用麦屿本产品及服务，或制作、发布、传播上述工具；<br>
              7.2.1.7 自行或者授权他人、第三方本产品对本产品及其组件、模块、数据进行干扰；<br>
              7.2.1.8 其他未经麦屿明示授权的行为。
            </span>
            <span>
              7.2.2 您理解并同意，基于用户体验、Openpo或相关服务平台运营安全、平台规则要求及健康发展等综合因素，麦屿有权选择提供服务的对象，有权决定功能设置，有权决定功能开放、数据接口和相关数据披露的对象和范围。针对以下情形，有权视具体情况中止或终止提供本服务，包括但不限于：
            </span>
            <p style="font-size: 13px;">
              7.2.2.1 违反法律法规或本协议规定的；<br>
              7.2.2.2 影响服务体验的；<br>
              7.2.2.3 存在安全隐患的；<br>
              7.2.2.4 与Openpo或其服务平台已有主要功能或功能组件相似、相同，或可实现上述功能或功能组件的主要效用的；<br>
              7.2.2.5 界面、风格、功能、描述或使用者体验与Openpo或其服务平台类似，可能造成Openpo用户认为其所使用的功能或服务来源于麦屿或经麦屿授权的；<br>
              7.2.2.6 违背Openpo或其服务平台运营原则，或不符合麦屿其他管理要求的。
            </p>
            <h4>
              7.3 服务运营规范
            </h4>
            <span>
              除非法律允许或麦屿书面许可，您使用本服务过程中不得从事下列行为：
            </span>
            <span>
              7.3.1 提交、发布虚假信息，或冒充、利用他人名义的；<br>
              7.3.2 诱导其他用户点击链接页面或分享信息的；<br>
              7.3.3 虚构事实、隐瞒真相以误导、欺骗他人的；<br>
              7.3.4 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；<br>
              7.3.5 未经麦屿书面许可利用Openpo帐号、功能帐号和任何功能，以及第三方运营平台进行推广或互相推广的；<br>
              7.3.6 利用Openpo帐号或功能帐号或本产品及服务从事任何违法犯罪活动的；<br>
              7.3.7 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；<br>
              7.3.8 其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或麦屿未明示授权的行为。
            </span>
            <h4>7.4 对自己行为负责</h4>
            <span>您充分了解并同意，您必须为自己注册帐号下的一切行为负责，包括您所发表的任何内容、评论及点赞、推荐等行为，以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。麦屿无法且不会对因前述风险而导致的任何损失或损害承担责任。
            </span>
            <h4>7.5 违约处理</h4>
            <span style="font-size: 14px;">
              7.5.1 如果麦屿发现或收到他人举报或投诉用户违反本协议约定的，麦屿有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚，并公告处理结果。<br>
              7.5.2 您理解并同意，麦屿有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。<br>
              7.5.3 您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；麦屿因此遭受损失的，您也应当一并赔偿。<br>
              7.5.4 Openpo的产品及服务只在产品平台上或由麦屿直接对外出售或者赠送使用权，用户不得在任何其他平台或渠道购买Openpo的虚拟产品或服务。对于用户使用非官方提供或者售卖的虚拟产品或服务造成经济等损失或被封号的情况，Openpo不对其负责；如因通过其他平台或他人代充等方式给Openpo造成损失的，用户应当承担违约责任并赔偿损失。
            </span>
          </ElTabPane>
          <ElTabPane label="八、知识产权声明">
            <p>
              8.1 麦屿是本产品的知识产权权利人。本产品的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本产品相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，麦屿享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。
            </p>
            <p>
              8.2 未经麦屿或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。
            </p>
            <p>
              8.3 您使用本产品及服务过程中上传、发布的全部内容，均不会因为上传、发布行为发生知识产权、肖像权等权利的转移。与此同时，您理解并同意麦屿为实现产品目的，对您发布的特定公开非保密内容（如“视频动态”、“自拍表情”和“视频号内容”等）在法律允许的范围内进行使用，包括但不限于予以存储、向有关用户播放、供有关用户获取及再次使用等。
            </p>
          </ElTabPane>
          <ElTabPane label="九、终端安全责任">
            <p>
              9.1 您理解并同意，本产品同大多数互联网本产品一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他本产品或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全，继而影响本产品的正常使用等。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。<br>
              9.2 您不得制作、发布、使用、传播用于窃取Openpo帐号、功能帐号及他人个人信息、财产的恶意程序。<br>
              9.3 维护本产品安全与正常使用是麦屿和您的共同责任，麦屿将按照行业标准合理审慎地采取必要技术措施保护您的终端设备信息和数据安全，但是您承认和同意麦屿并不能就此提供完全保证。<br>
              9.4 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意麦屿有关防范诈骗犯罪的提示。
            </p>
          </ElTabPane>
          <ElTabPane label="十、第三方本产品或技术">
            <p>
              10.1 本产品可能会使用第三方本产品或技术（包括本产品可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。<br>
              10.2 本产品如果使用了第三方的本产品或技术，麦屿将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本产品安装包特定文件夹中打包、或通过开源本产品页面等形式进行展示，它们可能会以“本产品使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议、其他文件及网页，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求麦屿给予协助，您应当自行承担法律责任。<br>
              10.3 如因本产品使用的第三方本产品或技术引发的任何纠纷，应由该第三方负责解决，麦屿不承担任何责任。麦屿不对第三方本产品或技术提供客服支持，若您需要获取支持，请与第三方联系。
            </p>
          </ElTabPane>
          <ElTabPane label="十一、其他">
            <p>
              11.1 您使用本产品即视为您已阅读并同意受本协议的约束。麦屿有权在必要时修改本协议条款。您可以在本产品的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本产品，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本产品。<br>
              11.2 本协议签订地为中华人民共和国上海市浦东新区。<br>
              11.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。<br>
              11.4 若您和麦屿之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。<br>
              11.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。<br>
              11.6 本协议可能存在包括中文、英文在内的多种语言的版本，如果存在中文版本与其他语言的版本相冲突的地方，以中文版本为准。<br>
              11.7 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。<br>
              11.8 如果您实施了违反前款规定的行为，您应当独立为此承担相应责任，我们不承担任何责任。由此造成损害的，您应依法予以赔偿，我们将保留依法追偿损失及赔偿的权利。<br>
              11.9因为您违反本协议规定的行为而对麦屿造成的损失，包括但不限于因您的行为导致或产生的任何第三方主张的任何索赔、要求或损失，以及我们处理这些事务的必要支出，例如律师费等，您同意赔偿麦屿的上述损失，并使之免受损害。
            </p>
          </ElTabPane>
          <ElTabPane label="十二、风险与免责">
            <p>
              若因下列事件导致您的个人及企业信息和隐私泄露，我们将尽最大努力进行补救或为您提供协助，但您同意我们无需承担任何责任：<br>
              （1）因病毒、木马、黑客攻击而导致的信息泄露；<br>
              （2）由于您将用户密码告知他人，或导致他人掌握您的用户密码，或与他人共享注册账户，由此导致的任何个人及企业信息的泄漏；<br>
              （3）任何其他非因麦屿的原因导致的个人及企业信息泄漏。<br>
            </p>
            <span style="font-size: 15px;">
              （正文完）
              麦屿(上海)数据科技有限公司
              Wheatisle</span>
          </ElTabPane>
        </div>
      </ElTabs>
    </ElTabPane>
  </ElTabs>
</template>
<script lang="ts" setup>
const activeName = ('first');
</script>

<style lang="less" scoped>
.demo-tabs {
  padding-left: 10px;
  border-radius: 8px;

  * {
    width: 90%;
  }

  :deep(.el-tabs__content) {
    padding-top: 15px;
    padding-left: 50px;
    font-size: 16px;
    line-height: 1.8;
    color: #00174c;

    .info-show {
      max-height: 520px;
      padding: 8px;
      overflow-y: auto;
    }

    p {
      padding-left: 10px;
      margin-bottom: 5px;
    }

    span {
      display: block;
      padding-left: 28px;
      margin-bottom: 15px;
      font-size: 14px;
    }
  }
}

</style>

